tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1823_tdd.h
#define P1DC4                         522
#define P1DC5                         523
#define P1DC6                         524
#define P1RSEN                        525
#define PSS1BD                        526
#define PSS1BD0                       527
#define PSS1BD1                       528
#define PSS1AC                        529
#define PSS1AC0                       530
#define PSS1AC1                       531
#define CCP1AS                        532
#define CCP1AS0                       533
#define CCP1AS1                       534
#define CCP1AS2                       535
#define CCP1ASE                       536
#define PSTR1CON                      537
#define STR1A                         538
#define STR1B                         539
#define STR1C                         540
#define STR1D                         541
#define STR1SYNC                      542
#define IOCAP                         543
#define IOCAP0                        544
#define IOCAP1                        545
#define IOCAP2                        546
#define IOCAP3                        547
#define IOCAP4                        548
#define IOCAP5                        549
#define IOCAN0                        550
#define IOCAN                         551
#define IOCAN1                        552
#define IOCAN2                        553
#define IOCAN3                        554
#define IOCAN4                        555
#define IOCAN5                        556
#define IOCAF0                        557
#define IOCAF                         558
#define IOCAF1                        559
#define IOCAF2                        560
#define IOCAF3                        561
#define IOCAF4                        562
#define IOCAF5                        563
#define CLKRCON                       564
#define CLKRDIV                       565
#define CLKRDIV0                      566
#define CLKRDIV1                      567
#define CLKRDIV2                      568
#define CLKRDC                        569
#define CLKRDC0                       570
#define CLKRDC1                       571
#define CLKRSLR                       572
#define CLKROE                        573
#define CLKREN                        574
#define MDCON                         575
#define MDBIT                         576
#define MDCON_MDOUT                   577
#define MDOPOL                        578
#define MDSLR                         579
#define MDOE                          580
#define MDEN                          581
#define MDSRC                         582
#define MDMS0                         583
#define MDMS                          584
#define MDMS1                         585
#define MDMS2                         586
#define MDMS3                         587
#define MDMSODIS                      588
#define MDCARL                        589
#define MDCL0                         590
#define MDCL                          591
#define MDCL1                         592
#define MDCL2                         593
#define MDCL3                         594
#define MDCLSYNC                      595
#define MDCLPOL                       596
#define MDCLODIS                      597
#define MDCARH                        598
#define MDCH                          599
#define MDCH0                         600
#define MDCH1                         601
#define MDCH2                         602
#define MDCH3                         603
#define MDCHSYNC                      604
#define MDCHPOL                       605
#define MDCHODIS                      606
#define STATUS_SHAD                   607
#define C_SHAD                        608
#define DC_SHAD                       609
#define Z_SHAD                        610
#define WREG_SHAD                     611
#define BSR_SHAD                      612
#define PCLATH_SHAD                   613
#define FSR0L_SHAD                    614
#define FSR0H_SHAD                    615
#define FSR1L_SHAD                    616
#define FSR1H_SHAD                    617
#define STKPTR                        618
#define TOSL                          619
#define TOSH                          620

#endif // _PIC16F1823_H_
